EXECUTE  [dbo].[USP_ComplementaryQuestions_Save] 1, N'E', N'I', N'- علاقمند به صحبت و تبادل
- لذت بردن از گروه ها
- اول حرف می زنم بعد فکر می کنم
- گسترش انرژی
- توجه به بیرون
- اهل صحبت
- علاقمند به تنوع و عمل
- معاشرتی
- فکر کردن به صدای بلند
- لذت بردن از بحث', N'- علاقمند به تنهایی
- لذت بردن از صحبت دو نفری
- اول فکر می کنم بعد حرف می زنم
- تمرکز انرژی
- توجه به درون
- ساکت
- توجه به یک موضوع در هر زمان
- در خود و محطاط
- در خود فکر کردن
- لذت بردن از فکر کردن'

EXECUTE  [dbo].[USP_ComplementaryQuestions_Save] 2, N'S', N'N', N'- توجه به حقایق ، اطلاعات موثق
- علاقمند به آنچه واقعیت دارد
- توجه به جزئیات
- واقع بین و عملی
- توجه به لحظه اکنون
- عمل گرا
- اعتماد به تجربه گذشته
- توجه به اشیاء و امور به شکلی که وجود دارد', N'- توجه به بینش ، فراست و اطلاعات انتزاعی
- علاقمند به آنچه امکان پذیر و یحتمل است
- توجه به تصویر بزرگ
- توجه به الهام و تصور
- توجه به آینده
- توجه به نوآوری
- تعمق کننده
- اعتماد به تصور و حرف دل
- توجه به تجربه کردن چیزهای نو'

EXECUTE  [dbo].[USP_ComplementaryQuestions_Save] 3, N'T', N'F', N'- ذهن محکم دارند
- مسئله را تحلیل می کنند
- ذهنی هستند ، با منطبق مجاب می شوند
- رک و صریح هستند
- برای صلاحیت و شایستگی ارزش قایل اند
- با مغز خود تصمیم می گیرند
- در استناد کردن مهارت دارند
- به عدالت بها می دهند
- ممکن است بی احساس ارزیابی شوند
- معمولا موضوعات را شخصی نمی کنند', N'- دل ملایمی دارند ، مهربان هستند
- با مسئله همدردی می کنند
- عینی هستند
- مودب هستند
- به روابط بها می دهند
- با دل خود تصمیم می گیرند
- به هماهنگی بها می دهند
- در قدردانی کردن مهارت دارند
- ممکن است بیش از اندازه احساسی ارزیابی شوند
- معمولا موضوعات را شخصی می کنند'

EXECUTE  [dbo].[USP_ComplementaryQuestions_Save] 4, N'J', N'P', N'- توجه به بسته بودن
- توجه به ساختار
- برنامه ریزی از قبل
- علاقه به نظم
- اول کار بعد تفریح
- تمایل به تمام کردن پروژه
- هدف گرا
- ساختار زیاد
- توجه به تصمیم گیری', N'- توجه به باز بودن
- توجه به جریان
- سازگار کردن خود با جریان
- علاقه به انعطاف پذیری
- اول تفریح بعد کار
- تمایل به شروع کردن پروژه ها
- فرایند گرا
- عدم سخت گیری
- توجه به خود به خودی'

