EXEC USP_Temperaments_Save N'NF', N'آرمان گرا', NULL, NULL, NULL, NULL, NULL, NULL, N'*آنها از عشق و عاشقی استقبال می کنند . از این رو برایشان کارت پستال بفرستید ، از آنها تعریف کنید ، در آغوششان بکشید و به آنها به اشکال مختلف مهر و عشق بورزید .
*از آنها به سبب عشق عمیقی که می توانند داشته باشند تشکر و قدر دانی کنید .
*به آنها اطمینان خاطر بدهید که اگر نه بگویند شما آنها را ردنمی کنید و یا از آنها عصبانی نمی شوید.
*وقتی به آنها جواب می دهید مودب باشید. NF ها از اینکه تایید نشوند ناراحت می شوند انتقاد از آنها می تواند به عزت نفس آنها لطمه بزند .
*آنها را تشویق کنید که ازروش های شخصی و خلاق خود پیروی کنند و اثر کارشان را در معرض دید جهانیان بگذارند .
*نیاز آنها رابه ابزار کردن احساساتشان درک کنید.
*از آنها به خاطر تغییر روحیه شان انتقاد نکنید.'

EXEC USP_Temperaments_Save N'NT', N'دانش گرا', NULL, N'نوآور، تحلیل گر، روشن، مستقل ، با نمک و با صلاحیت هستند اما از سوی دیگر همین ها خودبین ، بدبین ، انتقادگر و حق به جانب هستند . به دانش و صلاحیت بهای فراوان می دهند . آنها به هوش و فراست خود و دیگران اهمیت می دهند و پیوسته تلاش می کنند تا بر صلاحیت های خود بیفزایند. حل مسئله و تسلط بر دانش های جدید برای آنها موضوع مهمی است.', NULL, NULL, NULL, NULL, N'* بگذارید بدانند که شما از دانش ، عینی بودن ، سریع النتقال بودن و خلق و خوی خوش آنها به نیکی یاد می کنید . به نیاز آنها به استقلال داشنت و خود مختار بودن احترام بگذارید.
* به علایق خود توجه کنید . برای معاشرت های اجتماعی خود بیش از اندازه به آنها متکی نشوید. بیش از حد متکی به آنها نباشید .
* با آنها در مورد مسائل جالب صحبت کنید.
* به هنگام صحبت ، سعی نکنید با احساسات خود آنها را کلافه کنید.
* از صحبت کردن با آنها نگران نشوید و اگر با آنها بحث کردید ، حرف هایشان را شخصی نکنید و به دل نگیرید .
* اگر با آنها مشورت می کنید این را با آنها در میان بگذارید.'

EXEC USP_Temperaments_Save N'SJ', N'وظیفه گرا', NULL, NULL, NULL, NULL, NULL, NULL, N'*اگر کار اشتباهی کردهاید ابزار ندامت بکنید آنها از اینکه بشنوند شما از کارتان ناراحت شده اید لذت میبرند.
*از، جدیت و فاداری و تمایلشان برای قبول مسئولیت تعریف کنید.
*بدانید کهsgها از ابهام سردرگمی تاخیر و اتلاف خوششان نمی آید .
* به تعهدات خود و فادار باقی بمانید.
*از میل و علاقه آنها به قبول مسئولیتهای بیشتر سوء استفاده نکنید.
*به احساس سنتی بودن و توجه آنها به نظم اجتماعی بها بدهید.
*دقیق و مشخص حرف بزنید و رفتار کنید sjها از عق سلیم استقبال می کنند و از اطلاعات نظریه ها و یا اندیشه های انتزاعی لذت می برند .
*آنها را به انجام دادن کاری مجبور نکنید مقاومت آنها را در برابر تغییر کردن درک کنید.'

EXEC USP_Temperaments_Save N'SP', N'عمل گرا', NULL, NULL, NULL, NULL, NULL, NULL, N'*از پشتکار خوشبینی عقل سلیم ، واقع بینی و توانایی آنها در کنار آمدن با بحران تعریف کنید.
*در فعالیت ها و تن به ماجرا دادن های انها سهیم شوید .
*به آنها آزادی عمل بدهید . آنها را بیش از اندازه در کارهای روز مره گرفتار نکنید.
*به هنگام درخواست کردن از آنها ، به آنها امکان انتخاب بدهید  SP ها دوست دارند کارهایشان را مطابق میل خودشان انجام دهند.
*سعی نکنید آنها را تغییر بدهید و یا به آنها بگویید که چه باید بکنند .
* از تحلیل کردن بیش از اندازه ، پردازش احساسات  و  یا بحث درباره نظریه ها و امور مجرد و انتزاعی خودداری ورزید.
*سر آنها را با مباحث مختلف شلوغ نکنید . برای هر مسئله دقت کافی در نظر بگیرید .'